'''GIT - это система контроля версий (записывает изменения файла или набора файлов в течении времени). Предназначен отслеживания ведения истории изменений файловв проекте. Благодаря ему, можем вернуть старую версию программы'''

'''gtihub - это онлайн скрвис, предлогает услуги по хранению репозиториев и управления доступом'''

'''команды'''
# git init - инициализация нашего объекта и создание папки .git(в ней содержатся все необходимые файлы нашего репозитория)

# git add (./<filename>) - добавляет файлы с рабочей директории в промежуточное пространство - индекс(сепциальное промежуточноее пространство, в котором храняться измения файлов на пути от рабочей папки до репоритория)

# git commit - добавлет все файлы которые находятся в индексе во внутреннюю бд и сохраняет их состояние на данный момент 

# git remove add origin url(https or ssh) - добавляет удаленный репозиторий который находится на каком-нибудь сервере

# git push -u origin <branch name> - отправка кода в удаленный репозиторий

# git branch - показывает список веток

# git branch <branch name> - создает ветку с названием <branch name>

# git checkout <branch name> - переключает на ветку <branch name>

# git pull origin <branch name> - стягиваем иизменения с ветки <branch name> к себе на локалку

# git status - показывает статус проекта

# git log - журнал коммитов

# git clone ссылка_на_удаленный_репозиторий - склонировать/скопировать/скачать удаленный репощитоорий 